
&НаСервере
Функция ВыгрузитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	РезультатВыгрузки = ОбработкаОбъект.Выгрузить();
		
	Возврат РезультатВыгрузки; 
	
КонецФункции

&НаКлиенте
Процедура Выгрузить(Команда)
	
	РезультатВыгрузки = ВыгрузитьНаСервере();
	Если РезультатВыгрузки.Успешно Тогда
        ТекстСообщения = "Успешно!";
	Иначе
		ТекстСообщения = СтрШаблон("Ошибка выгрузки данных %1",РезультатВыгрузки.ОписаниеОшибки);
	КонецЕсли; 
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	Если РезультатВыгрузки.Свойство("Данные") Тогда
		Для каждого ДанныеВыгрузки Из РезультатВыгрузки.Данные Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("%1 : %2",ДанныеВыгрузки.Ключ, ДанныеВыгрузки.Значение));		
		КонецЦикла; 
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Функция ВыгрузитьСувенирыНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	РезультатВыгрузки = ОбработкаОбъект.ВыгрузитьСувениры();
		
	Возврат РезультатВыгрузки; 
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьСувениры(Команда)
	
	РезультатВыгрузки = ВыгрузитьСувенирыНаСервере();
	Если РезультатВыгрузки.Успешно Тогда
        ТекстСообщения = "Успешно!";
	Иначе
		ТекстСообщения = СтрШаблон("Ошибка выгрузки данных %1",РезультатВыгрузки.ОписаниеОшибки);
	КонецЕсли; 
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	Если РезультатВыгрузки.Свойство("Данные") Тогда
		Для каждого ДанныеВыгрузки Из РезультатВыгрузки.Данные Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("%1 : %2",ДанныеВыгрузки.Ключ, ДанныеВыгрузки.Значение));		
		КонецЦикла; 
	КонецЕсли;	

КонецПроцедуры


&НаСервере
Процедура ПередЗакрытиемНаСервере()
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОтветСервера = ОбработкаОбъект.ЗагрузитьНастройки();
	Если ОтветСервера.Успешно Тогда
		Если ТипЗнч(ОтветСервера.Данные)=Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма, ОтветСервера.Данные);
		КонецЕсли;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Элементы.Родитель.СписокВыбора.Очистить();
	Элементы.РодительСув.СписокВыбора.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Элементы.Родитель.СписокВыбора.Добавить(Выборка.Ссылка,Выборка.Наименование);
		Элементы.РодительСув.СписокВыбора.Добавить(Выборка.Ссылка,Выборка.Наименование);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция СтруктураНастроек()
	
	СтруктураПараметров = Новый Структура;
	
	Если ВключаяОсновные Тогда
		Для каждого ЭлементФормы Из Элементы Цикл
			Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") Тогда
				Имя = ЭлементФормы.ПутьКДанным; 
				ПозицияТочки = СтрНайти(Имя,".");
				Если ПозицияТочки > 0 Тогда
					Имя = Сред(Имя,ПозицияТочки + 1);
				КонецЕсли; 
				СтруктураПараметров.Вставить(Имя,Вычислить(ЭлементФормы.ПутьКДанным));		
			КонецЕсли; 	
		КонецЦикла; 
	Иначе
		СтруктураПараметров.Вставить("АдресРесурса", АдресРесурса);
		СтруктураПараметров.Вставить("Логин", Логин);
		СтруктураПараметров.Вставить("Пароль", Пароль);
		СтруктураПараметров.Вставить("РазмерПакета", РазмерПакета);
		СтруктураПараметров.Вставить("ПоследнийВыгруженныйОбъект", ПоследнийВыгруженныйОбъект);
		СтруктураПараметров.Вставить("ДатаПоследнейВыгрузки", ДатаПоследнейВыгрузки);		
	КонецЕсли; 
	
	Возврат СтруктураПараметров;
	
КонецФункции
 

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	СтруктураПараметров = СтруктураНастроек();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОтветСервера = ОбработкаОбъект.СохранитьНастройки(СтруктураПараметров);
	Если ОтветСервера.Успешно Тогда
        ТекстСообщения = "Успешно!";
	Иначе
		ТекстСообщения = СтрШаблон("Ошибка сохранения параметров %1",ОтветСервера.ОписаниеОшибки);
	КонецЕсли; 
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
КонецПроцедуры

